app/controllers/messages_controller.rb

  def find_conversation
    @conversation = Conversation.find(params[:conversation_id])
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]