app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at ASC
---
  def index
    @messages = Message.order('created_at ASC')