app/controllers/users_controller.rb

  def index
    @users = User.order('created_at ASC')
---
SELECT "users".* FROM "users" ORDER BY created_at ASC