app/controllers/volunteers_controller.rb

SELECT "volunteers".* FROM "volunteers" ORDER BY request_due_date ASC
---
  def index
    @volunteers = Volunteer.order('request_due_date ASC')

INSERT INTO "volunteers" ("request_type", "description", "location", "latitude", "longitude", "status", "request_due_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    # @volunteer = current_user.volunteers.build(volunteer_params)
    @volunteer = Volunteer.new(volunteer_params)

    if @volunteer.save

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @volunteer = Volunteer.find(params[:id])

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @volunteer = Volunteer.find(params[:id])